{
  "app": {
    "title": "Test de Tipo de Estrés 🔥 - DopaBrain",
    "description": "¿Agotamiento? ¿Ansiedad? ¿Ira? ¿Evitación? Descubre tu patrón de respuesta al estrés con 20 preguntas.",
    "loading": "Cargando..."
  },
  "intro": {
    "title": "Test de Tipo de Estrés",
    "sub": "¿Cuál es tu patrón de respuesta al estrés?",
    "desc": "Agotamiento, ansiedad, ira, evitación — ¿cómo reaccionas cuando estás bajo estrés?",
    "meta1": "📋 20 preguntas",
    "meta2": "⏱ ~3 minutos",
    "meta3": "🔒 Gratis",
    "start": "Comenzar el test",
    "userCount": "Más de 32.000 personas ya lo han hecho"
  },
  "scale": {
    "never": "Nunca",
    "sometimes": "A veces",
    "often": "A menudo",
    "always": "Siempre"
  },
  "analyzing": {
    "text": "Analizando tu tipo de estrés...",
    "step1": "Analizando patrones de respuesta...",
    "step2": "Determinando tu tipo...",
    "step3": "Preparando estrategias personalizadas..."
  },
  "result": {
    "dominant": "Tipo principal",
    "scoreBreakdown": "Puntuación por tipo",
    "warning": "⚠️ Señales de advertencia",
    "strategy": "💊 Estrategias de afrontamiento",
    "recommended": "🔗 Apps recomendadas",
    "copyLink": "🔗 Copiar enlace",
    "tweet": "🐦 Compartir en Twitter",
    "copied": "¡Enlace copiado!",
    "retry": "↩ Repetir el test",
    "back": "Inicio de DopaBrain"
  },
  "share": {
    "text": "Mi tipo de estrés es {type}. ¡Descubre el tuyo! 👇"
  },
  "types": {
    "burnout": {
      "emoji": "🔥",
      "name": "Agotamiento",
      "chip": "Tipo agotado",
      "subtitle": "Desgastado por el exceso de trabajo y responsabilidades",
      "desc": "Eres del tipo agotamiento — alguien que se ha exigido sin descanso bajo el peso de la responsabilidad y el deber. Incluso cuando tu energía está al límite, sientes culpa por descansar, y lo que antes amabas ha empezado a parecer sin sentido. El agotamiento no es mera fatiga; es un profundo agotamiento de recursos físicos, emocionales y cognitivos. Sin atención, puede derivar en depresión crónica o enfermedad física grave, por lo que el autocuidado es ahora tu prioridad más alta.",
      "warnings": [
        "Fatiga extrema que no mejora ni con el descanso",
        "Cinismo creciente y distancia emocional del trabajo y la vida",
        "Parálisis cognitiva: dificultad para concentrarse o tomar decisiones simples",
        "Síntomas físicos: dolores de cabeza, problemas digestivos, inmunidad debilitada"
      ],
      "strategies": [
        "Reserva 30 minutos diarios de 'no hacer nada' en tu calendario",
        "Establece límites digitales: desactiva las notificaciones de trabajo al salir",
        "Practica la monotarea: céntrate completamente en una sola cosa a la vez",
        "Programa al menos una actividad o hobby placentero a la semana",
        "Practica decirle a alguien de confianza: 'Estoy pasándolo mal'"
      ],
      "apps": ["white-noise", "pomodoro-timer", "detox-timer"]
    },
    "anxiety": {
      "emoji": "😰",
      "name": "Ansiedad",
      "chip": "Preocupación crónica",
      "subtitle": "Un ciclo constante de preocupación y tensión",
      "desc": "Eres del tipo ansioso — tu mente rara vez está en calma, dando vueltas sin parar a preocupaciones grandes y pequeñas. Tiendes a imaginar repetidamente escenarios catastróficos que interrumpen tu sueño y dificultan las actividades cotidianas. La ansiedad desperdicia energía manteniéndote atrapado en el pasado o el futuro e impide que disfrutes el presente. La tensión crónica también afecta al cuerpo: palpitaciones, tensión muscular y problemas digestivos que, si se ignoran, pueden convertirse en un trastorno de ansiedad.",
      "warnings": [
        "Rumiación imparable: pensamientos preocupantes que se repiten en bucle",
        "Insomnio o sueño deficiente que genera fatiga crónica",
        "Hipersensibilidad a la opinión ajena y ansiedad social agravada",
        "Síntomas físicos: cefaleas, calambres estomacales, tensión muscular persistente"
      ],
      "strategies": [
        "Limita tu 'tiempo de preocupación' a 15 minutos diarios; postpone todo lo demás",
        "Practica la respiración 4-7-8 (inhala 4 s · aguanta 7 s · exhala 8 s) tres veces al día",
        "Escribe tus preocupaciones y clasifícalas en 'controlables' e 'incontrolables'",
        "Prueba la meditación de atención plena o la relajación muscular progresiva",
        "Reduce la cafeína y el alcohol y mantén un horario de sueño constante"
      ],
      "apps": ["white-noise", "detox-timer", "pomodoro-timer"]
    },
    "anger": {
      "emoji": "😤",
      "name": "Ira",
      "chip": "Tipo explosivo",
      "subtitle": "El estrés que erupciona como ira intensa",
      "desc": "Eres del tipo ira — cuando el estrés se acumula, explota en forma de enojo intenso, a veces abrumador. Eres especialmente sensible a la injusticia y sueles reprimir sentimientos hasta que estallan de golpe. La ira es una emoción natural, pero la ira descontrolada daña relaciones importantes y afecta seriamente tu vida profesional. Detrás de la ira a menudo se esconden sentimientos más profundos — heridas, miedo o impotencia — que vale la pena explorar.",
      "warnings": [
        "Palabras o actos impulsivos que dañan relaciones cercanas",
        "Intenso sentimiento de culpa y autodesprecio tras el estallido",
        "Daño a la reputación y escalada de conflictos en el trabajo",
        "Impacto físico: presión arterial elevada y mayor riesgo cardiovascular"
      ],
      "strategies": [
        "Cuando sientas ira, aléjate de inmediato y aplica la 'regla de los 10 segundos'",
        "Lleva un diario de ira para identificar qué situaciones te disparan constantemente",
        "Practica la relajación muscular progresiva: tensa cada grupo muscular 5 s y suelta",
        "Expresa tus emociones con 'mensajes en primera persona': 'Me enojo cuando...'",
        "Utiliza el ejercicio aeróbico regular para liberar de forma saludable la energía del estrés acumulado"
      ],
      "apps": ["white-noise", "pomodoro-timer", "detox-timer"]
    },
    "avoidance": {
      "emoji": "😔",
      "name": "Evitación",
      "chip": "Tipo escapista",
      "subtitle": "Huir de los problemas en lugar de afrontarlos",
      "desc": "Eres del tipo evitación — ante el estrés, tu instinto es retroceder, ignorar o huir en vez de enfrentar. Encontrar refugio en el scroll, los videojuegos o el ajetreo da alivio temporal, pero los problemas sin resolver se acumulan y vuelven como una crisis mayor. La evitación ofrece protección emocional a corto plazo, pero a largo plazo erosiona tu autoconfianza y profundiza la impotencia. Dar pequeños pasos hacia los problemas hoy puede prevenir un gran derrumbe mañana.",
      "warnings": [
        "Problemas sin resolver que se acumulan hasta convertirse en una crisis",
        "Dependencia creciente de las redes sociales, los videojuegos o la comida como escape",
        "Oportunidades perdidas por procrastinación crónica en decisiones importantes",
        "Baja autoestima e impotencia aprendida ('de todas formas no funcionará')"
      ],
      "strategies": [
        "La 'regla de los 5 minutos': comprométete a hacer la tarea temida solo 5 minutos y observa qué pasa",
        "Divide el problema evitado en la única acción mínima siguiente y hazla sola",
        "Usa una app para limitar redes sociales y videojuegos a una hora diaria",
        "Ábrete a un amigo de confianza y buscad soluciones juntos",
        "Imagina vívidamente el resultado positivo de resolver el problema para aumentar tu motivación"
      ],
      "apps": ["detox-timer", "pomodoro-timer", "white-noise"]
    }
  },
  "questions": {
    "q1": "Ya me siento cansado/a cuando me despierto por la mañana",
    "q2": "Incluso después del trabajo, no puedo dejar de pensar en tareas y responsabilidades",
    "q3": "Lo que antes disfrutaba ya no me parece agradable ni significativo",
    "q4": "Me pregunto cuánto tiempo más podré seguir así",
    "q5": "Incluso después de descansar lo suficiente, mi energía no se siente repuesta",
    "q6": "Incluso las cosas pequeñas me preocupan y no me dejan en paz",
    "q7": "Sigo imaginando los peores escenarios posibles",
    "q8": "Me cuesta dormirme o me despierto frecuentemente durante la noche",
    "q9": "Me preocupa en exceso lo que los demás piensen de mí",
    "q10": "Me siento tenso/a o ansioso/a sin razón aparente",
    "q11": "Cuando estoy estresado/a, me enfado fácilmente por cosas menores",
    "q12": "Me resulta difícil tolerar situaciones injustas",
    "q13": "He estallado emocionalmente después de contenerme demasiado tiempo",
    "q14": "Cuando me enojo, se me escapan palabras duras o insultos",
    "q15": "Actúo impulsivamente de formas de las que luego me arrepiento",
    "q16": "Aunque tenga problemas que resolver, los ignoro deliberadamente",
    "q17": "Cuando estoy estresado/a, me pierdo en exceso en redes sociales, videojuegos o televisión",
    "q18": "Sigo postergando decisiones importantes",
    "q19": "Me mantengo deliberadamente ocupado/a para no sentir mis emociones",
    "q20": "Escapar del problema me da alivio momentáneo, pero la situación acaba empeorando"
  },
  "apps": {
    "white-noise": {
      "name": "Ruido Blanco",
      "desc": "Sonidos ambientales para dormir y concentrarse"
    },
    "pomodoro-timer": {
      "name": "Temporizador Pomodoro",
      "desc": "Trabaja de forma eficiente sin agotarte"
    },
    "detox-timer": {
      "name": "Temporizador Detox Digital",
      "desc": "Rompe el hábito de escapar hacia lo digital"
    }
  }
}
